fluidizedbedTest_restart/CFD/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // wall
	CAD_patch1
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);
    }
	CAD_patch3
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);
    }
	fbBioin
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);
    }
	
    fbGasin
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);;
    }
    fbOut
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);
    }
}


// ************************************************************************* //
